Linvicky0/373-finalProject/lcd_display1/Core/Src/Lcd/stm32_ili9488_lcd.c
  DrawProp.TextColor = color_backup;
  BSP_LCD_SetTextColor(DrawProp.TextColor);
}

/**
  * @brief  Displays one character.
  * @param  Xpos: Start column address
  * @param  Ypos: Line where to display the character shape.
  * @param  Ascii: Character ascii code
  *   This parameter must be a number between Min_Data = 0x20 and Max_Data = 0xFF (or while the font last)
  * @retval None
  */
void BSP_LCD_DisplayChar(uint16_t Xpos, uint16_t Ypos, uint8_t Ascii)
{
  DrawChar(Xpos, Ypos, &DrawProp.pFont->table[(Ascii-' ') *\
                        DrawProp.pFont->Height * ((DrawProp.pFont->Width + 7) / 8)]);
}

/**
  * @brief  Displays one multilayer big character and display on string (typical: caption on a multi-layered icon)
  * @param  Xpos: Start column address
  * @param  Ypos: Line where to display the character shape.
  * @param  Chars: Characters ascii code
  *   This parameter must be a number between Min_Data = 0x20 and Max_Data = 0xFF (or while the font last)
  * @param  Colors: Character layer colors
  * @param  sf: Font table address
  * @param  onX: onString relative X position
  * @param  onY: onString relative Y position
  * @param  onChars: onString character array address (if NULL -> no onChar, font and color from DrawProp)
  * @retval None
  */
void BSP_LCD_DisplayStringOnMultilayerChar(uint16_t Xpos, uint16_t Ypos, uint8_t *Chars, uint16_t *Colors, sFONT *sf,
                                           uint16_t onX, uint16_t onY, uint8_t *onChars)
{
  uint16_t x, y, ay = 0;                /* actual coordinatas */
  uint16_t ocs;                         /* one character size (byte) in character set */
  uint16_t csbc = 0;                    /* charset byte counter */
  uint16_t li = 0;                      /* layer index */
  uint16_t fbbi = 0;                    /* fontbitmap buf index */
  uint16_t fbco;                        /* fontbitmap actual color */
  uint16_t bmsy;                        /* fontbitmap buffer y size */
  uint16_t onfbbi;                      /* fontbitmap buf index */
  uint16_t onwidth;                     /* onstring full width (pixel) */
  uint16_t onchi;                       /* onstring character index */
  uint16_t onocs;                       /* onstring one character size (byte) in character set */
  uint16_t onchlsize;                   /* onstring font line size [byte] */
  uint16_t oncx;                        /* onstring actual characacter x pos */
  uint16_t oncy = 0;                    /* onstring actual characacter y pos */
  uint8_t  csb[MAX_CHAR_LAYER] = {0};   /* actual byte in character set */
  uint8_t  cbm = 0;                     /* character set bitmap mask */

  if((FONTBITMAPBUFSIZE) < sf->Width)
    return;
  bmsy = (FONTBITMAPBUFSIZE) / sf->Width; /* fontbitmap buf y size */
  ocs = sf->Height * ((sf->Width + 7) / 8);
  onocs = DrawProp.pFont->Height * ((DrawProp.pFont->Width + 7) / 8);
  onchlsize = ((DrawProp.pFont->Width + 7) / 8);

  onwidth = strlen((char *)onChars) * DrawProp.pFont->Width;
  if(onX >= sf->Width)
    onX = sf->Width;
  if(onwidth >= sf->Width - onX)
    onwidth = sf->Width - onX;

  for(y = 0; y < sf->Height; y++)
  {
    for(x = 0; x < sf->Width; x++)
    {
      if(!cbm)
      { /* charcter set byte step */
        cbm = 0x80;
        li = 0;
        while(Chars[li] >= ' ' && li < MAX_CHAR_LAYER)
        {
          csb[li] = sf->table[(Chars[li] - ' ') * ocs + csbc];
          li++;
        }
        csbc++;
      }

      fbco = DrawProp.BackColor;
      li = 0;
      while(Chars[li] >= ' ' && li < MAX_CHAR_LAYER)
      {
        if(csb[li] & cbm)
          fbco = Colors[li];
        li++;
      }

      fontbitmapbuf[fbbi++] = fbco;
      cbm >>= 1;
    } /* for(x = 0; x < sf->Width; x++) */

    /* onChars */
    if(onChars && y >= onY && y < onY + DrawProp.pFont->Height)
    {
      onfbbi = fbbi + onX - sf->Width;
      oncx = 0;
      onchi = 0;
      cbm = 0;

      for(x = 0; x < onwidth; x++)
      {
        if(!cbm)                                  /* byte step in character table ?*/
        { /* charcter set byte step */
          cbm = 0x80;
          csb[0] = DrawProp.pFont->table[(onChars[onchi]-' ') * onocs + onchlsize * oncy + oncx / 8];
        }
        oncx++;
        if(csb[0] & cbm)
          fontbitmapbuf[onfbbi] = DrawProp.TextColor;
        onfbbi++;
        cbm >>= 1;
        if(oncx >= DrawProp.pFont->Width)
        {
          oncx = 0;
          onchi++;
          cbm = 0;
        }
      }
      oncy++;
    } /* if(y >= onY && y < onY + DrawProp.pFont->Height) */

    cbm = 0;
    ay++;
    if(ay >= bmsy)
    {
      BSP_LCD_DrawRGB16Image(Xpos, Ypos + y + 1 - ay, sf->Width, ay, fontbitmapbuf);
      ay = 0;
      fbbi = 0;
    }
  } /* for(y = 0; y < sf->Height; y++) */
  if(ay)
  {
    BSP_LCD_DrawRGB16Image(Xpos, Ypos + y - ay, sf->Width, ay, fontbitmapbuf);
  }
}

/**
  * @brief  Displays characters on the LCD.
  * @param  Xpos: X position (in pixel)
  * @param  Ypos: Y position (in pixel)
  * @param  Text: Pointer to string to display on LCD
  * @param  Mode: Display mode
  *          This parameter can be one of the following values:
  *            @arg  CENTER_MODE
  *            @arg  RIGHT_MODE
  *            @arg  LEFT_MODE
  * @retval None
  */
void BSP_LCD_DisplayStringAt(uint16_t Xpos, uint16_t Ypos, uint8_t *Text, Line_ModeTypdef Mode)
{
  uint16_t refcolumn = 1, i = 0;
  uint32_t size = 0, xsize = 0;
  uint8_t  *ptr = Text;

  /* Get the text size */
  while (*ptr++) size ++ ;

  /* Characters number per line */
  xsize = (BSP_LCD_GetXSize()/DrawProp.pFont->Width);

  switch (Mode)
  {
  case CENTER_MODE:
    {
      refcolumn = Xpos + ((xsize - size)* DrawProp.pFont->Width) / 2;
      break;
    }
  case LEFT_MODE:
    {
      refcolumn = Xpos;
      break;
    }
  case RIGHT_MODE:
    {
      refcolumn =  - Xpos + ((xsize - size)*DrawProp.pFont->Width);
      break;
    }
  default:
    {
      refcolumn = Xpos;
      break;
    }
  }

  /* Send the string character by character on lCD */
  while ((*Text != 0) & (((BSP_LCD_GetXSize() - (i*DrawProp.pFont->Width)) & 0xFFFF) >= DrawProp.pFont->Width))
  {
    /* Display one character on LCD */
    BSP_LCD_DisplayChar(refcolumn, Ypos, *Text);
    /* Decrement the column position by 16 */
    refcolumn += DrawProp.pFont->Width;
    /* Point on the next character */
    Text++;
    i++;
  }
}

/**
  * @brief  Displays a character on the LCD.
  * @param  Line: Line where to display the character shape
  *          This parameter can be one of the following values:
  *            @arg  0..19: if the Current fonts is Font8
  *            @arg  0..12: if the Current fonts is Font12
  *            @arg  0...9: if the Current fonts is Font16
  *            @arg  0...7: if the Current fonts is Font20
  *            @arg  0...5: if the Current fonts is Font24
  * @param  ptr: Pointer to string to display on LCD
  * @retval None
  */
void BSP_LCD_DisplayStringAtLine(uint16_t Line, uint8_t *ptr)
{
  BSP_LCD_DisplayStringAt(0, LINE(Line), ptr, LEFT_MODE);
}

/**
  * @brief  Draws a pixel on LCD.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  RGB_Code: Pixel color in RGB mode (5-6-5)
  * @retval None
  */
void BSP_LCD_DrawPixel(uint16_t Xpos, uint16_t Ypos, uint16_t RGB_Code)
{
  lcd_drv->WritePixel(Xpos, Ypos, RGB_Code);
}

/**
  * @brief  Draws an horizontal line.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  Length: Line length
  * @retval None
  */
void BSP_LCD_DrawHLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length)
{
  lcd_drv->DrawHLine(DrawProp.TextColor, Xpos, Ypos, Length);
}

/**
  * @brief  Draws a vertical line.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  Length: Line length
  * @retval None
  */
void BSP_LCD_DrawVLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length)
{
  lcd_drv->DrawVLine(DrawProp.TextColor, Xpos, Ypos, Length);
}

/**
  * @brief  Draws an uni-line (between two points).
  * @param  x1: Point 1 X position
  * @param  y1: Point 1 Y position
  * @param  x2: Point 2 X position
  * @param  y2: Point 2 Y position
  * @retval None
  */
void BSP_LCD_DrawLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
  int16_t deltax = 0, deltay = 0, x = 0, y = 0, xinc1 = 0, xinc2 = 0,
  yinc1 = 0, yinc2 = 0, den = 0, num = 0, numadd = 0, numpixels = 0,
  curpixel = 0;

